{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "Transformer_Temporal", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 90, 18], "dtype": "float32", "sparse": false, "ragged": false, "name": "era5_input", "optional": false}, "registered_name": null, "name": "era5_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "input_projection", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 90, 18]}, "name": "input_projection", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 90, 18], "dtype": "float32", "keras_history": ["era5_input", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add"}, "registered_name": "Add", "name": "add", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 90, 64], "dtype": "float32", "keras_history": ["input_projection", 0, 0]}}, {"class_name": "__tensor__", "config": {"value": [[-0.015816211700439453, -0.015672363340854645, -0.01169896125793457, -0.040309201925992966, -0.007746540009975433, 0.02053183689713478, -0.003880072385072708, 0.024413753300905228, 0.0446903370320797, -0.04473816230893135, 0.022343363612890244, 0.04077520594000816, -0.036744557321071625, 0.016869891434907913, -0.03094637393951416, 0.004640590399503708, -0.02064194716513157, 0.0002358555793762207, -0.018324218690395355, 0.021322477608919144, 0.03746730461716652, 0.016855333000421524, 0.024461951106786728, -0.006435096263885498, 0.021665025502443314, -0.02181539498269558, -0.0034816041588783264, -0.04814772680401802, 0.004503034055233002, 0.0291004441678524, -0.024244679138064384, -0.004339255392551422, 0.0022738799452781677, 0.008141554892063141, -0.029105722904205322, -0.002355862408876419, 0.024180743843317032, 0.020258676260709763, 0.0026964060962200165, -0.03192831575870514, -0.03510073572397232, 0.012042902410030365, -0.018903708085417747, 0.005063604563474655, -0.030048727989196777, -0.018336784094572067, -0.01963130198419094, 0.02023562416434288, 0.04580142721533775, 0.0034635066986083984, -0.006149660795927048, -0.03490178659558296, -0.020258570089936256, 0.01129840686917305, 0.04957130178809166, 0.014067161828279495, -0.024534178897738457, -0.03628023713827133, 0.013355638831853867, -0.024011874571442604, 0.0030401237308979034, 0.03515206649899483, 0.003589462488889694, 0.0019343867897987366], [-0.033510781824588776, -0.022060109302401543, -0.0008714310824871063, -0.04110080003738403, -0.03781137615442276, -0.03589700534939766, 0.010246265679597855, 0.01841188594698906, 0.006010949611663818, 0.04158354178071022, -0.047200631350278854, -0.024035537615418434, 0.0031989924609661102, -0.04299596697092056, 0.04435786232352257, -0.009637665003538132, -0.03178206831216812, -0.0004355795681476593, -0.043967604637145996, -0.030324483290314674, 0.022085998207330704, -0.011672735214233398, -0.018592189997434616, -0.010123848915100098, -0.04440796375274658, 0.015745844691991806, 0.038337718695402145, -0.007663179188966751, 0.029247116297483444, -0.04684264585375786, -0.046495795249938965, 0.03687721863389015, 0.041637662798166275, 0.02283727005124092, -0.022785747423768044, 0.031920742243528366, 0.021243128925561905, 0.04087669774889946, -0.03695790842175484, 0.03461437299847603, -0.03228168562054634, -0.048987723886966705, 0.021673548966646194, 0.0208672396838665, 0.030391540378332138, 0.039768483489751816, -0.04794589430093765, -0.0011151432991027832, 0.01047351211309433, 0.02870270237326622, 0.04694856330752373, 0.010563861578702927, 0.024953749030828476, -0.023322343826293945, -0.04973536729812622, 0.031201612204313278, -0.003240920603275299, 0.03679892048239708, -0.013299070298671722, 0.017631974071264267, -0.025127900764346123, 0.048117827624082565, -0.025589799508452415, -0.023030543699860573], [-0.03158152103424072, 0.02438882365822792, -0.018402300775051117, 0.03553379699587822, 0.03552447631955147, -0.03461047261953354, 0.021888483315706253, 0.046400975435972214, -0.0018747933208942413, 0.0006997585296630859, 0.012158680707216263, -0.033322788774967194, -0.007779739797115326, 0.011906255036592484, -0.001940906047821045, 0.03552241250872612, 0.041066695004701614, 0.024115268141031265, -0.023997783660888672, -0.03622306510806084, 0.011498380452394485, -0.02311127260327339, 0.026659000664949417, 0.029319647699594498, 0.04582078382372856, -0.04943146929144859, 0.031437840312719345, 0.018446173518896103, 0.03163382038474083, -0.03889685869216919, 0.04827592149376869, -0.03690992668271065, -0.02687840536236763, 0.04323861375451088, 0.04302256181836128, 0.016475442796945572, 0.00821688026189804, 0.0044252872467041016, 0.004766296595335007, 0.04739353433251381, 0.010748457163572311, 0.016748499125242233, 0.008842002600431442, 0.01782294735312462, 0.04855476692318916, 0.0478820838034153, -0.030526017770171165, 0.0024599432945251465, -0.00502399355173111, -0.03496696799993515, -0.025036228820681572, 0.03525138273835182, 0.03527634218335152, 0.0323776938021183, -0.030411243438720703, -0.03547091409564018, 0.03183218464255333, -0.0011178627610206604, -0.044631268829107285, -0.00041294097900390625, -0.005525805056095123, -0.031117141246795654, 0.018405701965093613, 0.016361739486455917], [0.033674005419015884, -0.04535486921668053, 0.03597978129982948, 0.034546349197626114, -0.036538444459438324, 0.028612401336431503, -0.024248922243714333, -0.03598616272211075, -0.0034139975905418396, 0.030058715492486954, -0.013642191886901855, 0.010279141366481781, 0.022194337099790573, -0.04733079671859741, 0.02056359127163887, 0.04064067825675011, -0.03933579847216606, -0.01862802356481552, 0.01776159182190895, -0.04205242544412613, 0.02631464973092079, -0.045543670654296875, 0.024728845804929733, -0.03273437172174454, 0.048271480947732925, -0.016921639442443848, 0.02342316135764122, 0.013376343995332718, -0.047772493213415146, -0.034224141389131546, 0.04302581772208214, 0.002019248902797699, 0.022862229496240616, -0.021898329257965088, -0.025097429752349854, 0.03879803791642189, 0.010993458330631256, 0.009898066520690918, -0.021202577278017998, -0.034656822681427, 0.04511455073952675, 0.007737636566162109, 0.015150513499975204, 0.04441461339592934, -0.04523472860455513, 0.03811999782919884, 0.004166901111602783, -0.026653064414858818, -0.00041980668902397156, -0.04351102188229561, -0.03737213462591171, -0.022243106737732887, 0.02874032035470009, -0.01697666570544243, 0.04629025235772133, -0.015716541558504105, -0.03925608471035957, 0.006312917917966843, -0.047087229788303375, -0.010456275194883347, -0.019008709117770195, 0.03871067985892296, 0.03731440380215645, 0.0301683209836483], [0.017097745090723038, -0.013662122189998627, -0.035029660910367966, -0.0075537338852882385, -0.006231047213077545, -0.017518043518066406, -0.00970999151468277, -0.016166698187589645, -0.011803649365901947, 0.04702725633978844, 0.02678961679339409, -0.034254420548677444, 0.04731332138180733, 0.04728246107697487, 0.0268416665494442, 0.017867613583803177, -0.02440437115728855, -0.007961153984069824, 0.04877347871661186, -0.02019556798040867, 0.033396076411008835, 0.04425536468625069, 0.03430083021521568, -0.010982237756252289, -0.03353480249643326, -0.02019435167312622, -0.018481861799955368, 0.007874786853790283, 0.033746566623449326, -0.022258175536990166, 0.011124573647975922, 0.04818112030625343, 0.0032715685665607452, 0.00229484960436821, 0.014882508665323257, 0.04834158346056938, -0.02965499274432659, 0.006996572017669678, -0.004480838775634766, 0.029789913445711136, -0.04621536657214165, 0.006517399102449417, -0.021116960793733597, 0.029071059077978134, 0.024219561368227005, -0.03906381130218506, -0.03654557466506958, 0.005630623549222946, -0.04832738637924194, 0.017954323440790176, -0.02454296313226223, 0.045448433607816696, 0.01536872610449791, -0.006108880043029785, -0.0002547726035118103, 0.0036749131977558136, -0.001589704304933548, -0.00045294687151908875, -0.04533664137125015, -0.009157456457614899, -0.036661840975284576, -0.03310312330722809, 0.025880005210638046, 0.031608905643224716], [0.012723658233880997, 0.00793987512588501, -0.026283418759703636, 0.03505459800362587, -0.0058653466403484344, 0.017053555697202682, -0.004851292818784714, -0.007847212255001068, 0.014034453779459, 0.045641470700502396, -0.016639329493045807, -0.005262531340122223, -0.02009054459631443, 0.040801968425512314, -0.02116340398788452, 0.04422292485833168, 0.044578079134225845, 0.015607301145792007, -0.004238177090883255, -0.03659682348370552, 0.023455630987882614, 0.0154564268887043, 0.011497937142848969, -0.04061063379049301, 0.006668604910373688, -0.02162308804690838, -0.028726136311888695, 0.02830645814538002, 0.002464722841978073, -0.04305511713027954, 0.009621381759643555, 0.024097587913274765, 0.01834675297141075, 0.03940330818295479, -0.04130131006240845, 0.048781681805849075, -0.029212618246674538, 0.045196402817964554, -0.03112088516354561, 0.02806052193045616, 0.007133733481168747, -0.028927195817232132, 0.02925533428788185, -0.04266728088259697, 0.022751476615667343, 0.003809679299592972, -0.01646789163351059, -0.019104743376374245, -0.04957710579037666, -0.01802222803235054, 0.010105349123477936, 0.04024997726082802, 0.03737226501107216, 0.04717094078660011, -0.02332092635333538, -0.005096934735774994, 0.032760072499513626, 0.021578039973974228, -0.005058310925960541, -0.016159772872924805, 0.01614638790488243, -0.0411999449133873, -0.0224007498472929, -0.028081154450774193], [-0.025154460221529007, -0.04303225502371788, 0.021144617348909378, -0.02434626780450344, 0.006340730935335159, -0.04252568632364273, 0.03707355633378029, 0.037477102130651474, 0.0007278323173522949, -0.018207252025604248, 0.012707378715276718, -0.01141749694943428, 0.0029097795486450195, 0.04458056762814522, 0.02031579241156578, -0.007260285317897797, -0.020965708419680595, 0.02640077844262123, -0.020565295591950417, 0.03874960169196129, -0.008935440331697464, -0.03068751096725464, 0.0030470602214336395, 0.02570420876145363, 0.002737712115049362, -0.02355269156396389, 0.04013008996844292, -0.021379603073000908, -0.03425552695989609, -0.02629547193646431, -0.002257358282804489, -0.03409931808710098, 0.04020794853568077, 0.04168199375271797, -0.014858007431030273, -0.030693983659148216, -0.017735935747623444, -0.04632759094238281, 0.03737762197852135, -0.009800590574741364, 0.0497581847012043, -0.026627933606505394, -0.027746547013521194, 0.00403439998626709, 0.01870976760983467, -0.0251799114048481, 0.014259468764066696, 0.008042801171541214, 0.01508798822760582, 0.013662997633218765, -0.02137584798038006, 0.039856042712926865, 0.013529311865568161, 0.03676966205239296, 0.03025202825665474, -0.043875802308321, -0.042623139917850494, 0.035530056804418564, -0.02701716497540474, 0.03291330114006996, -0.03207874298095703, 0.017921973019838333, -0.001104198396205902, -0.03507264703512192], [-0.03160438686609268, 0.046822596341371536, -0.02077770233154297, 0.004372108727693558, -0.008390508592128754, -0.008026443421840668, -0.045598115772008896, 0.001462150365114212, -0.006401084363460541, -0.031001722440123558, -0.011468518525362015, -0.048307131975889206, 0.01130068302154541, -0.04544335603713989, -0.014019452035427094, 0.0014522671699523926, 0.010033942759037018, 0.019742179661989212, 0.028795305639505386, 0.026910636574029922, 0.005669761449098587, 0.04848090186715126, -0.021250976249575615, 0.019167054444551468, 0.0023228153586387634, -0.010690174996852875, 0.04306662455201149, -0.018066130578517914, -0.021740544587373734, -0.019507313147187233, 0.046124521642923355, -0.01848447322845459, -0.032278694212436676, -0.005567312240600586, -0.03305434063076973, 0.013576056808233261, 0.008061490952968597, -0.034185610711574554, 0.012552294880151749, -0.048676349222660065, -0.01484912633895874, -0.0324755534529686, -0.04738318920135498, 0.025428559631109238, -0.03018895350396633, 0.008216094225645065, -0.026731086894869804, -0.04251091554760933, 0.03384688124060631, 0.036158714443445206, -0.04303843900561333, 0.03307298198342323, -0.007405020296573639, -0.040825117379426956, -0.015157163143157959, -0.03642692416906357, -0.025587856769561768, 0.02454514428973198, 0.003837786614894867, -0.02294299565255642, -0.0006656423211097717, -0.04308047518134117, 0.024745475500822067, -0.03082265891134739], [0.03975880518555641, -0.0348423607647419, -0.0250519048422575, 0.0030683986842632294, 0.004483591765165329, 0.021291758865118027, 0.03346002474427223, -0.008111726492643356, -0.043322693556547165, 0.047210242599248886, 0.04966993257403374, -0.03322877734899521, -0.016259096562862396, 0.04744460806250572, -0.006158102303743362, -0.017922639846801758, 0.005596887320280075, 0.019954930990934372, -0.007767092436552048, -0.01597583293914795, 0.005931306630373001, -0.02915889024734497, -0.0464908592402935, 0.03577602282166481, -0.042434848845005035, 0.03021017089486122, 0.01773625984787941, 0.015475761145353317, -0.03679795190691948, 0.026731107383966446, 0.0325910709798336, 0.016994480043649673, -0.006376992911100388, 0.004071544855833054, 0.026712562888860703, 0.010469935834407806, -0.02961275540292263, 0.036747340112924576, -0.026608943939208984, -0.02946796454489231, -0.022516954690217972, -0.014246068894863129, -0.02477259747684002, -0.04793046787381172, -0.023172689601778984, -0.03717397525906563, -0.029663050547242165, 0.014209065586328506, -0.04947635158896446, 0.008170615881681442, 0.040942538529634476, 0.04216822609305382, -0.017980266362428665, 0.039151739329099655, 0.010918140411376953, -0.004320167005062103, 0.028745342046022415, -0.03352577984333038, -0.034332383424043655, -0.04784637689590454, 0.046708349138498306, 0.048944879323244095, -0.036590419709682465, 0.04948223754763603], [-0.01368100568652153, -0.047374166548252106, 0.015694323927164078, -0.02534555271267891, -0.030874956399202347, -0.043772220611572266, -0.022105956450104713, -0.019340980798006058, 0.042209792882204056, 0.0071402788162231445, -0.03456848859786987, 0.04910888895392418, 0.02599480375647545, -0.04632912948727608, -0.006995297968387604, -0.04170290380716324, -0.028558075428009033, -0.0418136827647686, 0.026753593236207962, 0.02434467151761055, 0.040708672255277634, -0.024398434907197952, 0.030330348759889603, -0.03194230794906616, 0.03285637125372887, 0.021993543952703476, -0.04910154268145561, 0.04568810388445854, 0.043491754680871964, 0.0036096684634685516, -0.04764913395047188, -0.04952266439795494, -0.016818512231111526, 0.02654946967959404, -0.029187191277742386, -0.015182435512542725, -0.00654689222574234, -0.028863191604614258, 0.04610096290707588, 0.008401323109865189, -0.022611653432250023, 0.010521352291107178, -0.02217428758740425, 0.03983289375901222, 0.027502845972776413, -0.026866985484957695, 0.039131056517362595, -0.015429534018039703, -0.046218644827604294, 0.030810903757810593, 0.01847565546631813, 0.04866376891732216, -0.024888742715120316, -0.01916329935193062, 0.018799472600221634, 0.040386054664850235, 0.02461821213364601, 0.027412082999944687, 0.00835810974240303, 0.008604802191257477, 0.037722598761320114, 0.00439833477139473, -0.0036278143525123596, 0.04218362644314766], [0.02133326604962349, 0.013058271259069443, -0.014095257967710495, 0.031537774950265884, -0.04357127100229263, -0.0023959986865520477, -0.03293507173657417, 0.0216757170855999, 0.005840681493282318, -0.03425905853509903, -0.04683877155184746, -0.017023909837007523, -0.03661688417196274, 0.0049520619213581085, -0.018010340631008148, 0.019606400281190872, 0.04363277181982994, 0.027252864092588425, -0.0440768264234066, 0.007988989353179932, -0.01868605613708496, -0.03673306852579117, 0.022976484149694443, -0.0049418918788433075, -0.008495260030031204, 0.030983950942754745, -0.03365910053253174, -0.006221722811460495, -0.047062791883945465, 0.040565911680459976, 0.049305979162454605, -0.0025378093123435974, 0.0020932182669639587, 0.03995959833264351, 0.0031629689037799835, -0.048623014241456985, -0.015228115022182465, -0.022286225110292435, 0.030971262603998184, 0.016288969665765762, 0.025708142668008804, -0.03373851627111435, 0.04166611656546593, -0.018870174884796143, 0.03726987913250923, -0.015184439718723297, 0.04949924722313881, 0.023944508284330368, -0.02652660571038723, 0.030115138739347458, 0.0362992025911808, 0.04070239141583443, -0.024258745834231377, -0.02416682243347168, -0.045541491359472275, 0.03472847864031792, -0.04766702651977539, -0.02862679958343506, 0.011873532086610794, 0.0072181336581707, -0.010849379003047943, -0.03966166824102402, 0.02698996290564537, -0.04325293377041817], [-0.0418500080704689, -0.008507024496793747, -0.019206320866942406, 0.002505730837583542, 0.0214349664747715, 0.02374103292822838, 0.030703473836183548, -0.021993769332766533, -0.04237513616681099, -0.04248619079589844, 0.0362684391438961, 0.027351204305887222, 0.04268563166260719, 0.038479600101709366, -0.02963772974908352, 0.03984621539711952, -0.010795257985591888, 0.008200861513614655, 0.03312340006232262, 0.008761048316955566, 0.008661758154630661, -0.007997415959835052, 0.01867225393652916, 0.009651768952608109, 0.04966776445508003, 0.008097253739833832, 0.006137274205684662, 0.01703406497836113, -0.030401920899748802, 0.04058033600449562, 0.04974037781357765, -0.043313171714544296, -0.03925396129488945, 0.029607128351926804, 0.043524350970983505, -0.03141220659017563, -0.02677863836288452, -0.01664571836590767, 0.039768267422914505, 0.004274249076843262, -0.0024577751755714417, -0.02896016836166382, -0.04060385376214981, -0.0174105167388916, -0.029696082696318626, -0.019049907103180885, -0.032749488949775696, -0.007110822945833206, -0.018317580223083496, 0.023942019790410995, 0.04380525276064873, 0.024567071348428726, -0.0002263300120830536, 0.047052931040525436, -0.01278216764330864, -0.012973524630069733, 0.04048451408743858, -0.03264869749546051, 0.014592204242944717, -0.04482531547546387, 0.02268514409661293, -0.028399383649230003, -0.025554073974490166, -0.04875481128692627], [0.03373772278428078, 0.03744744136929512, -0.029237616807222366, -0.00829780101776123, 0.04242021217942238, 0.04350488260388374, -0.03773083537817001, -0.008221279829740524, 0.01978117600083351, -0.035139549523591995, 0.027575645595788956, 0.02129969373345375, 0.048946086317300797, 0.023404035717248917, 0.016786489635705948, 0.035336460918188095, -0.0005841478705406189, -0.012348674237728119, 0.009824465960264206, 0.009968150407075882, -0.047432731837034225, -0.009990107268095016, 0.046180929988622665, 0.03599891439080238, 0.03208373859524727, 0.037755075842142105, -0.013962827622890472, 0.008457161486148834, 0.014895308762788773, 0.023454252630472183, 0.01741231605410576, 0.04857530817389488, 0.021485988050699234, -0.01188880205154419, 0.010785102844238281, -0.013814806938171387, -0.020302845165133476, -0.017460443079471588, 0.007437575608491898, 0.043043140321969986, 0.017484154552221298, 0.025660190731287003, 0.005395092070102692, 0.006836831569671631, -0.021799886599183083, -0.037466250360012054, 0.04026298597455025, -0.045087482780218124, -0.017310012131929398, -0.03944974020123482, 0.028331328183412552, 0.04053950682282448, -0.00653076171875, 0.006084643304347992, 0.009491108357906342, 0.031169984489679337, -0.04069262742996216, 0.04426255449652672, -0.048026230186223984, -0.019614553079009056, -0.023604143410921097, -0.04325934872031212, 0.008800219744443893, 0.03515132889151573], [0.028903018683195114, 0.035666774958372116, 0.029320690780878067, -0.03112424723803997, -0.011609353125095367, 0.04551638290286064, 0.03919890895485878, -0.02193269692361355, -0.03685634210705757, 0.02964520826935768, 0.04462674632668495, 0.004298161715269089, -0.041667282581329346, 0.04540855810046196, -0.02275487221777439, 0.013064373284578323, -0.03445087745785713, 0.008999932557344437, -0.03348193317651749, 0.005323302000761032, -0.002177119255065918, 0.023708190768957138, -0.022402703762054443, 0.017879139631986618, 0.0369865782558918, 0.03234971687197685, -0.013250529766082764, -0.013434123247861862, 0.02450975403189659, -0.03998915106058121, 0.010501347482204437, -0.001912914216518402, -0.008139051496982574, -0.03983251005411148, -0.002869643270969391, 0.013613630086183548, 0.036918509751558304, -0.03684049844741821, 0.04254218563437462, -0.012800764292478561, -0.013417400419712067, 0.007025100290775299, 0.01222982257604599, -0.04694730043411255, -0.013490449637174606, -0.04667091369628906, 0.0169021375477314, 0.016602788120508194, 0.027671102434396744, -0.013347208499908447, 0.02446296438574791, -0.011798907071352005, -0.026149405166506767, -0.020003272220492363, -0.015899132937192917, 0.03882959857583046, -0.04368877410888672, -0.024524200707674026, -0.038421403616666794, -0.03685548156499863, 0.01878446713089943, 0.006097376346588135, -0.02399127557873726, 0.011163033545017242], [-0.026553571224212646, 0.02959355339407921, -0.0028042569756507874, -0.008090566843748093, 0.01924368366599083, -0.000348605215549469, -0.028179515153169632, -0.021998846903443336, 0.007307805120944977, -0.01667926460504532, -0.01147477701306343, -0.0423339381814003, 0.008785080164670944, 0.04999878630042076, 0.040128376334905624, -0.04639724642038345, -0.024298107251524925, -0.0002704150974750519, -0.04006075859069824, 0.03529537096619606, 0.03354731574654579, 0.0331011526286602, -0.021786117926239967, 0.01890958473086357, 0.03033367171883583, 0.03726444020867348, 0.014473024755716324, -0.006361830979585648, -0.02740389108657837, -0.024296903982758522, -0.0303647518157959, -0.035690926015377045, 0.007798492908477783, -0.028955554589629173, 0.025772560387849808, -0.04946951940655708, -0.04312894493341446, -0.01923145167529583, 0.02264929935336113, -0.007403146475553513, 0.023499514907598495, 0.0011488907039165497, 0.004520118236541748, -0.030038058757781982, 0.047915127128362656, 0.016355540603399277, 0.030271116644144058, -0.001422334462404251, -0.019334638491272926, 0.01977170631289482, 0.010350275784730911, -0.0463721863925457, 0.01090778037905693, -0.019507838413119316, -0.029388785362243652, 0.015618946403265, 0.049875665456056595, -0.010541807860136032, -0.008133042603731155, 0.02882525697350502, -0.01589787006378174, -0.038785457611083984, 0.0037731900811195374, 0.00035037845373153687], [-0.041075121611356735, 0.04201377555727959, 0.024385247379541397, 0.0070135705173015594, -0.005885161459445953, 0.04555828496813774, 0.03580104187130928, 0.02150600031018257, -0.04764919355511665, -0.020732641220092773, 0.036734405905008316, 0.042671117931604385, -0.009760666638612747, 0.005845595151185989, -0.03245478868484497, -0.049629129469394684, 0.0014765150845050812, 0.018834445625543594, -0.047354865819215775, -0.03719012811779976, -0.04979058727622032, 0.003446735441684723, -0.04662398248910904, -0.0010436661541461945, 0.017035748809576035, -0.042144693434238434, 0.0011415481567382812, 0.0361153744161129, -0.006254158914089203, 0.024471048265695572, 0.009231042116880417, 0.018575336784124374, -0.023087192326784134, 0.029500197619199753, 0.035096097737550735, -0.003371618688106537, 0.02591491863131523, -0.046641360968351364, 0.008174587041139603, 0.007952846586704254, 0.005560196936130524, 0.025563959032297134, 0.027028057724237442, -0.01088787242770195, 0.0034969672560691833, -0.040803004056215286, 0.02695157751441002, -0.03750377893447876, -0.023211980238556862, 0.030320052057504654, 0.0025002136826515198, 0.028846506029367447, -0.029946887865662575, -0.017235327512025833, -0.02085517719388008, 0.006848085671663284, 0.0336228646337986, -0.0003010854125022888, 0.022554073482751846, -0.01123816892504692, 0.03934495523571968, -0.02617061138153076, -0.0496668703854084, -0.04577423259615898], [0.002936147153377533, -0.016425669193267822, 0.016339052468538284, -0.017286457121372223, -0.041622258722782135, 0.02224445715546608, -0.04088292270898819, 0.028735030442476273, 0.042230334132909775, -0.02326749637722969, 0.0024527907371520996, -0.04608039930462837, 0.020752612501382828, 0.0030751116573810577, 0.002886105328798294, 0.03192045912146568, -0.005558323115110397, 0.027606021612882614, -0.04610896110534668, -0.04554823786020279, -0.032541513442993164, 0.03713383898139, -0.04478936269879341, 0.043609488755464554, 0.04316990450024605, -0.034194961190223694, -0.02918107621371746, -0.004079949110746384, 0.027204837650060654, -5.889683961868286e-06, 0.03380941227078438, 0.024653006345033646, 0.036662507802248, -0.04018120840191841, -0.035970769822597504, -0.0026254281401634216, -0.01065758615732193, 0.031638238579034805, 0.03838460519909859, -0.027290916070342064, -0.015013623982667923, 0.023016873747110367, -0.024771785363554955, -0.0021566636860370636, -0.024513160809874535, 0.004020892083644867, 0.024715755134820938, 0.041749726980924606, 0.049915436655282974, 0.0353880412876606, 0.015006233006715775, 0.0432264469563961, -0.02087984047830105, -0.048552047461271286, 0.015828263014554977, -0.02027752436697483, -0.004885435104370117, 0.01936190202832222, 0.030706439167261124, 0.04853394255042076, -0.043862320482730865, -0.04032234102487564, -0.013348199427127838, 0.012182366102933884], [0.01619170978665352, 0.016576696187257767, -0.04928497225046158, -0.03416445106267929, 0.00823129341006279, -0.0006220228970050812, -0.037021853029727936, -0.017425477504730225, 0.026571933180093765, -0.01994885317981243, -0.010030139237642288, 0.012616422027349472, 0.04150111600756645, -0.0018522366881370544, 0.02418680116534233, -0.006539810448884964, -0.03217350319027901, 0.0008848682045936584, 0.03639792278409004, 0.04476990923285484, 0.018627356737852097, -0.03590524196624756, -0.0018598809838294983, -0.019441712647676468, 0.04557902738451958, 0.027654055505990982, 0.011859606951475143, 0.04023953899741173, 0.005286134779453278, 0.043893467634916306, -0.0048303380608558655, -0.03686348348855972, -0.03911886364221573, -0.02920936420559883, 0.03796125575900078, -0.016146503388881683, 0.03823712840676308, -0.041235290467739105, 0.022036287933588028, -0.04505578428506851, 0.04241306707262993, -0.04565221071243286, 0.011135291308164597, 0.015143755823373795, 0.036003146320581436, 0.01390601322054863, 0.047025490552186966, 0.03804894909262657, -0.032944440841674805, -0.02297081984579563, 0.01560467854142189, 0.0023494958877563477, -0.006015978753566742, 0.04897058382630348, -0.04791161045432091, -0.04831719398498535, -0.0012162812054157257, -0.030348921194672585, 0.027644697576761246, -0.019462455064058304, -0.025135839357972145, 0.006091512739658356, 0.012081526219844818, -0.044216956943273544], [0.02332894876599312, -0.02490333281457424, -0.018567096441984177, -0.015608929097652435, -0.033197320997714996, -0.0012207627296447754, -0.014606844633817673, 0.0023419037461280823, -0.013509023934602737, 0.0460379384458065, 0.022786546498537064, 0.024738263338804245, -0.020216023549437523, -0.036238767206668854, 0.043945420533418655, -0.006808243691921234, -0.04786799103021622, 0.0350625179708004, 0.01296970620751381, -0.041505586355924606, -0.023119796067476273, 0.045511115342378616, 0.0044076815247535706, -0.038550615310668945, 0.007656466215848923, 0.011462487280368805, 0.026961449533700943, 0.02516334131360054, 0.04522964730858803, 0.0012977942824363708, -0.023294543847441673, -0.04284852743148804, -0.02096458710730076, 0.04674513265490532, -0.03566540405154228, 0.02685605362057686, -0.03111201524734497, -0.028505945578217506, 0.03846590593457222, 0.04649145528674126, -0.01689598709344864, 0.014761772006750107, 0.017308000475168228, 0.03539018705487251, -0.008796967566013336, 0.04839766398072243, 0.02187580242753029, 0.03654143586754799, 0.03460157290101051, -0.02106541395187378, -0.013552643358707428, -0.04061688110232353, 0.04841182008385658, 0.006303917616605759, -0.0010076649487018585, 0.030419912189245224, 0.023373257368803024, 0.015191201120615005, -0.021567368879914284, 0.03542165830731392, 0.015314508229494095, -0.03238546848297119, 0.021312128752470016, 0.04982602968811989], [0.03354385867714882, -0.0258240457624197, 0.04506677761673927, 0.033433590084314346, 0.04018573835492134, 0.012733805924654007, -0.010896600782871246, -0.04619593545794487, 0.043034110218286514, 0.031161639839410782, 0.035508621484041214, 0.031619373708963394, -0.027998412027955055, -0.031339243054389954, 0.018916811794042587, -0.041666723787784576, 0.03538307175040245, -0.04646073654294014, 0.01123880222439766, -0.04078376293182373, -0.04178206995129585, -0.041346192359924316, 0.04618971422314644, -0.029925525188446045, -0.010465718805789948, -0.02470329962670803, 0.025283385068178177, -0.04011627286672592, 0.015704181045293808, -0.03518911451101303, 0.04803565517067909, -0.04193885251879692, -0.0405895821750164, -0.012113392353057861, -0.007525432854890823, 0.004192471504211426, -0.0164421908557415, -0.039336252957582474, 0.03043724223971367, -0.04030275344848633, -0.01725999265909195, -0.010055027902126312, -0.010391034185886383, -0.01093912124633789, -0.011156845837831497, -0.014711093157529831, 0.046059463173151016, 0.04827001318335533, -0.04020809009671211, -0.0022825710475444794, -0.004042185842990875, 0.0035204514861106873, 0.008529901504516602, -0.001040864735841751, -0.03781677410006523, -0.025134874507784843, 0.034127723425626755, -0.005962777882814407, 0.01551901176571846, -0.0024803653359413147, 0.023746062070131302, 0.039493490010499954, -0.04628119617700577, -0.030267346650362015], [-0.03688995912671089, -0.04142078012228012, -0.022340381518006325, -0.016056716442108154, 0.02815275266766548, -0.04101572185754776, -0.03993295505642891, 0.04856171831488609, 0.008327282965183258, 0.041574183851480484, 0.037818219512701035, -0.04735487699508667, 0.04566167667508125, -0.026543153449892998, -0.02065812423825264, 0.01133960485458374, 0.025718320161104202, 0.00822681188583374, 0.03571431711316109, 0.04578964784741402, 0.015881244093179703, -0.04151005670428276, 0.03253969922661781, -0.016149699687957764, 0.03303784504532814, 0.04937085881829262, -0.0371369831264019, -0.01673988252878189, -0.001635812222957611, 0.002026747912168503, -0.0153350830078125, 0.02648938074707985, -0.009608171880245209, 0.041963305324316025, -0.043429721146821976, 0.034768152981996536, -0.03148237615823746, -0.04727058485150337, 0.041811492294073105, -0.04488128423690796, 0.014089871197938919, 0.03609459474682808, 0.01303793117403984, -0.004808306694030762, 0.041724566370248795, 0.04607968404889107, -0.04191000387072563, 0.0360974557697773, 0.04365071281790733, 0.03552628681063652, -0.0391087643802166, 0.03163286671042442, -0.028119897469878197, 0.04923344776034355, -0.0020932182669639587, -0.03875149413943291, 0.017071034759283066, -0.04565577581524849, -0.007198084145784378, 0.007248152047395706, -0.042303360998630524, -0.036959338933229446, 0.014430012553930283, -0.049104560166597366], [-0.01986926794052124, -0.017741728574037552, 0.012697864323854446, -0.04538707807660103, -0.027388108894228935, 0.032140206545591354, -0.03662826865911484, 0.049803879112005234, -0.03392808511853218, 0.008201636373996735, 0.044141899794340134, 0.02674681320786476, -0.025583768263459206, -0.03492894023656845, -0.0005502477288246155, -0.015209890902042389, 0.008129656314849854, -0.002489052712917328, -0.017139364033937454, -0.0031054019927978516, 0.0009128078818321228, 0.03930092230439186, -0.008169889450073242, 0.004874657839536667, 0.0030023083090782166, -0.0019981488585472107, -0.023657286539673805, 0.027482274919748306, 0.019722525030374527, -0.04866461828351021, 0.047617826610803604, -0.027078092098236084, 0.04419833794236183, -0.043126847594976425, 0.017560910433530807, -0.049517977982759476, -0.027210092172026634, -0.008603490889072418, -0.015385150909423828, -0.006344366818666458, -0.048166729509830475, 0.01474667713046074, -0.04475296661257744, -0.013181675225496292, 0.03848903253674507, -0.00036063045263290405, -0.006881989538669586, 0.046484921127557755, -0.013495147228240967, 0.026065099984407425, -0.007174242287874222, 0.04573431983590126, 0.020543646067380905, -0.03021766059100628, 0.027186084538698196, 0.026712629944086075, 0.01735870912671089, 0.04360734298825264, 0.0007080323994159698, 0.0057364217936992645, 0.04292065277695656, -0.009070970118045807, 0.0032295212149620056, 0.011457525193691254], [-0.03966379165649414, -0.04294991493225098, -0.04787864908576012, 0.04760602489113808, 0.012713182717561722, -0.034841764718294144, -0.010172117501497269, 0.011792697012424469, 0.010379873216152191, -0.028383731842041016, -0.013454534113407135, 0.03079957887530327, -0.042770933359861374, 0.010372865945100784, 0.02768280729651451, 0.03468528762459755, 0.028192412108182907, 0.03042483702301979, 0.009332381188869476, 0.0030914172530174255, -0.04585136100649834, -0.04851316288113594, 0.033780064433813095, 0.047922637313604355, -0.038342785090208054, 0.03798014298081398, -0.001880098134279251, 0.022426996380090714, 0.036665383726358414, 0.033289339393377304, 0.03009611740708351, -0.02094661071896553, 0.01890336349606514, -0.026321887969970703, 0.02640526369214058, -0.016014087945222855, 0.019363168627023697, 0.01925497129559517, -0.027763832360506058, 0.020352553576231003, -0.0002931840717792511, 0.028415266424417496, 0.02198496088385582, -0.045952703803777695, -0.04160039499402046, 0.011271428316831589, 0.006516814231872559, 0.01675969734787941, -0.0037437304854393005, 0.0486685074865818, -0.029655516147613525, 0.011254347860813141, 0.003923453390598297, 0.028740573674440384, -0.011278998106718063, -0.03421448543667793, 0.0007114037871360779, -0.011904478073120117, 0.023714933544397354, 0.014360692352056503, -0.004408489912748337, -0.02537515200674534, 0.04914185032248497, -0.0021838657557964325], [0.03664977476000786, -0.034508705139160156, -0.02320007048547268, 0.04285765811800957, 0.0335061214864254, 0.03538769856095314, -0.009211458265781403, -0.04639693722128868, -0.00524139404296875, -0.010269809514284134, 0.017770972102880478, 0.03964604064822197, -0.02204827032983303, -0.0265609510242939, 0.012996051460504532, -0.002118658274412155, 0.04267284646630287, 0.02096724882721901, 0.036736514419317245, 0.010523058474063873, 0.03482898697257042, -0.010599065572023392, -0.04679100587964058, -0.013653136789798737, -0.014116894453763962, 0.006452787667512894, -0.015711914747953415, -0.044506754726171494, -0.04704984650015831, 0.038171980530023575, 0.02096475288271904, 0.04447897896170616, -0.01327040046453476, -0.02487971819937229, -0.04295608028769493, 0.049863506108522415, 0.043964508920907974, 0.000797666609287262, 0.017483655363321304, -0.02880162000656128, -0.015628933906555176, -0.0457925908267498, -0.02706071175634861, 0.00877746194601059, -0.012918531894683838, -0.0004722960293292999, -0.040047504007816315, 0.04282112047076225, 0.03265498951077461, 0.04424149915575981, 0.0047760009765625, -0.019774114713072777, 0.012094616889953613, 0.028453562408685684, -0.02135031297802925, -0.01951885223388672, 0.0011521466076374054, -0.026683509349822998, 0.0199015773832798, -0.015080809593200684, 0.01903573051095009, -0.030981624498963356, 0.009770214557647705, 0.0003019571304321289], [0.036949340254068375, -0.04596604034304619, -0.044878244400024414, 0.019129645079374313, 0.011416733264923096, -0.04662955924868584, 0.02006981149315834, 0.004656113684177399, -0.004262208938598633, -0.019806301221251488, 0.0355989970266819, -0.026369381695985794, -0.015834201127290726, 0.013229157775640488, -0.0071565136313438416, -0.007831357419490814, -0.019556356593966484, 0.02082384005188942, 0.03321213647723198, 0.020512890070676804, -0.04793505743145943, 0.025128807872533798, 0.04568853601813316, 0.012730780988931656, 0.003800082951784134, 0.00881340354681015, -0.038817405700683594, -0.026936983689665794, -0.006507553160190582, -0.04810851812362671, 0.044219281524419785, -0.047490622848272324, 0.008084557950496674, -0.017344165593385696, 0.013788674026727676, -0.0479249469935894, -0.0011221542954444885, -0.0060344114899635315, -0.027500677853822708, -0.02525489404797554, 0.0012694485485553741, -0.037675581872463226, -0.030401408672332764, 0.04161493852734566, 0.017239738255739212, 0.0402737595140934, 0.020387280732393265, -0.027761388570070267, 0.007115256041288376, -0.03513007238507271, 0.014552738517522812, -0.013578999787569046, 0.03345007821917534, 0.02925083413720131, -0.018939901143312454, -0.03440377861261368, -0.0061001889407634735, -0.026604486629366875, -0.0011601932346820831, 0.018909703940153122, -0.017561614513397217, -0.00989992544054985, 0.007567085325717926, -0.03540065139532089], [0.019717764109373093, -0.025621866807341576, 0.0346665121614933, 0.008798111230134964, 0.03817104175686836, 0.0486188642680645, 0.04842052236199379, 0.035417649894952774, 0.0174545980989933, -0.022864509373903275, -0.014787424355745316, 0.002369128167629242, -0.015024103224277496, 0.044761452823877335, 0.04429209604859352, -0.04517517238855362, -0.023037970066070557, -0.02363898791372776, 0.018982890993356705, 0.03612108156085014, -0.02056431770324707, 0.0026140809059143066, -0.040194105356931686, 0.01659022644162178, 0.011571802198886871, 0.030800867825746536, -0.04795944690704346, -0.041220784187316895, 0.02610326185822487, -0.02177382819354534, -0.0021532773971557617, -0.038295257836580276, 0.03290051594376564, -0.024847185239195824, 0.04786903038620949, -0.0032693855464458466, -0.0012527592480182648, -0.01622290536761284, 0.004018746316432953, -0.048388075083494186, 0.006712865084409714, 0.009156417101621628, 0.004601050168275833, 0.009904731065034866, 0.012053526937961578, -0.0198036078363657, 0.04225008562207222, -0.04762470722198486, -0.0044829361140728, 0.026902806013822556, -0.0238546971231699, 0.012511443346738815, 0.02830430492758751, -0.02209005318582058, -0.0291877631098032, -0.03501163795590401, 0.017994176596403122, -0.048259951174259186, -0.010552752763032913, -0.00880511850118637, 0.029918838292360306, 0.049949292093515396, 0.04937506094574928, -0.011933885514736176], [-0.011372912675142288, 0.0004949457943439484, 0.02568129077553749, 0.02785450592637062, 0.01255888119339943, 0.04349726811051369, 0.034561384469270706, -0.025605130940675735, 0.017546843737363815, 0.0031089559197425842, -0.007091235369443893, -0.036285340785980225, 0.03229032829403877, -0.00870199128985405, -0.026024674996733665, -0.013714741915464401, 0.03940092399716377, -0.005484890192747116, 0.025633562356233597, -0.004087269306182861, 0.0350782610476017, -0.027030086144804955, 0.01311543956398964, -0.04288787767291069, 0.040970657020807266, 0.024130139499902725, -0.022922396659851074, 0.028406891971826553, 0.04158114269375801, -0.028526080772280693, 0.04045109823346138, -0.021093642339110374, 0.03266855701804161, 0.015128407627344131, 0.015569556504487991, 0.013966251164674759, 0.003290880471467972, -0.02542020194232464, 0.039614904671907425, 0.022454407066106796, -0.022202957421541214, -0.037313055247068405, 0.044930484145879745, 0.009818829596042633, -0.017965592443943024, 0.04615278169512749, 0.008568048477172852, 0.021439362317323685, 0.001911889761686325, -0.0005896575748920441, -0.045308519154787064, -0.014480531215667725, -0.03341956436634064, 0.026560191065073013, 0.028591323643922806, -0.041951797902584076, 0.013356950134038925, 0.008626379072666168, 0.03164571896195412, -0.03643056005239487, 0.02984744682908058, 0.020147334784269333, -0.009160291403532028, 0.03412072733044624], [0.02788737788796425, 0.003159046173095703, 0.005560398101806641, -0.017873741686344147, 0.01568439230322838, -0.013844359666109085, -0.00428452342748642, -0.0078682079911232, -0.028927505016326904, -0.0015037059783935547, -0.031738150864839554, 0.04789891466498375, 0.04185985401272774, -0.04002363607287407, -0.004056621342897415, -0.022120345383882523, -0.039788853377103806, -0.03140479326248169, -0.03834187984466553, 0.002840530127286911, -0.04799482971429825, -0.03189728409051895, -0.02131180837750435, -0.049831558018922806, -0.02649611234664917, -0.012660861015319824, 0.025900211185216904, 0.02810145542025566, 0.035590264946222305, 0.03268212452530861, 0.03538710996508598, 0.03828222677111626, -0.014286387711763382, 0.04796222224831581, -0.028530670329928398, 0.009069360792636871, -0.016498077660799026, -0.04153262451291084, -0.018377434462308884, -0.018997108563780785, 0.04332606866955757, -0.03540194034576416, 0.008418310433626175, 0.016241852194070816, -0.02723541297018528, -0.011589966714382172, 0.04428786411881447, -0.03771920129656792, 0.02868102863430977, 0.03144611045718193, 0.006194375455379486, -0.022156596183776855, 0.028466548770666122, 0.00028325244784355164, -0.00032069534063339233, 0.049918029457330704, 0.01834038272500038, 0.03041047975420952, 0.011302053928375244, -0.0260918028652668, -0.015813756734132767, -0.0029721632599830627, -0.026936817914247513, -0.04552657529711723], [-0.029962290078401566, -0.02350463904440403, 0.002592802047729492, 0.003636084496974945, -0.015218280255794525, -0.03282444551587105, -0.015911877155303955, -0.0464695580303669, 0.004445455968379974, 0.008574176579713821, 0.01580164209008217, -0.00150226429104805, 0.0015580058097839355, -0.0048600658774375916, -0.007311653345823288, 0.01182793453335762, 0.03694448247551918, -0.02393040619790554, 0.004773963242769241, -0.00709899514913559, -0.008582722395658493, 0.02329755201935768, 0.0411551259458065, -0.0307443980127573, -0.03959912061691284, -0.022246336564421654, 0.023521844297647476, -0.04583989456295967, -0.031224239617586136, -0.028365815058350563, -0.01359955221414566, 0.03555557504296303, -0.0435415618121624, 0.00828712061047554, 0.049149129539728165, -0.029815828427672386, 0.025812294334173203, -0.04813596233725548, -0.020925773307681084, -0.0012952201068401337, -0.04109444469213486, -0.000223647803068161, -0.027408992871642113, -0.020772159099578857, -0.03659858554601669, -0.014364730566740036, -0.039263833314180374, 0.03086179867386818, -0.028839111328125, 0.01876181736588478, -0.046671297401189804, 0.02485647425055504, -0.03757864236831665, -0.005983710289001465, 0.029876913875341415, -0.03336304426193237, 0.049020085483789444, -0.02456733025610447, 0.00047330930829048157, 0.040352288633584976, 0.01332871988415718, -0.009231876581907272, -0.016099177300930023, 0.026413235813379288], [0.0137246735394001, -0.024364113807678223, 0.004929888993501663, 0.0048410892486572266, -0.046574998646974564, 0.029080364853143692, -0.03101431205868721, 0.008207093924283981, -0.030827689915895462, -0.02047755755484104, 0.04190143570303917, 0.04368377849459648, 0.02633061632514, -0.026486098766326904, -0.02799856662750244, -0.0017104372382164001, -0.018765343353152275, -0.018043674528598785, -0.024328768253326416, 0.01860271766781807, -0.049255430698394775, 0.00393366813659668, -0.005329955369234085, -0.0014767423272132874, -0.006756056100130081, 0.049444761127233505, -0.006357740610837936, -0.021279705688357353, 0.007589567452669144, 0.019306790083646774, 0.02185901626944542, 0.019329119473695755, 0.04037138447165489, 0.02130929008126259, -0.04205413907766342, 0.03573993220925331, 0.030661772936582565, -0.040276430547237396, 0.03594011440873146, -0.0028450004756450653, 0.004140041768550873, 0.039844218641519547, 0.02218623086810112, 0.04137406125664711, -0.017052162438631058, 0.01078794151544571, 0.011193107813596725, -0.043648768216371536, 0.010694243013858795, 0.041561853140592575, 0.005558717995882034, 0.004046820104122162, -0.04374725744128227, 0.01135551929473877, 0.019294824451208115, -0.016114376485347748, 0.014326605945825577, 0.004932034760713577, 0.04161319509148598, -0.04447297006845474, -0.02753654681146145, 0.02556944265961647, -0.0012483224272727966, 0.031338248401880264], [-0.005923129618167877, 0.003453422337770462, -0.04544037580490112, 0.012934554368257523, -0.02877708710730076, 0.0010247454047203064, 0.017617549747228622, 0.025352027267217636, -0.04641848802566528, -0.0454474575817585, 0.03251809999346733, -0.00560683012008667, 0.04572964832186699, 0.03750661388039589, -0.027067173272371292, 0.028063025325536728, -0.025169147178530693, 0.005826354026794434, 0.03189701959490776, 0.005738258361816406, -0.004331707954406738, 0.029308568686246872, -0.04451558738946915, -0.0003558509051799774, 0.033799659460783005, -0.04356621578335762, -0.035167086869478226, -0.019832421094179153, -0.028090788051486015, -0.041589222848415375, -0.04057244211435318, 0.04915812984108925, 0.039434995502233505, 0.0312579981982708, 0.017374981194734573, 0.026926282793283463, -0.03840760141611099, 0.02752106264233589, -0.047850754112005234, 0.013953957706689835, 0.03039867803454399, -0.019083846360445023, 0.024418603628873825, -0.015198718756437302, 0.032862547785043716, -0.02384662628173828, -0.03615372255444527, -0.039144136011600494, 0.03316560760140419, -0.039090633392333984, -0.008466757833957672, -0.02807324007153511, -0.004329323768615723, 0.015198756009340286, -0.010923612862825394, -0.023644793778657913, -0.03088761679828167, -0.01561586931347847, -0.04897907003760338, 0.016184959560632706, 0.031606320291757584, 0.03687666729092598, -0.03559427335858345, 0.03724226728081703], [-0.0006864182651042938, -0.020492231473326683, -0.016819417476654053, -0.021761834621429443, -0.005756758153438568, -0.04319629818201065, 0.046987880021333694, -0.004831455647945404, -0.006019867956638336, 0.04849604144692421, 0.004486691206693649, 0.013747181743383408, 0.02080428972840309, 0.046850744634866714, -0.04551959037780762, -0.008835531771183014, -0.02932673692703247, 0.027713585644960403, -0.023666370660066605, 0.024669457226991653, 0.01925751194357872, 0.013520780950784683, -0.04030630737543106, 0.04923415556550026, -0.0402345284819603, 0.012193083763122559, -0.04894312843680382, -0.031148958951234818, 0.037555743008852005, 0.004357375204563141, -0.04075385257601738, 0.03736389800906181, 0.010972298681735992, -0.04009382799267769, -0.0452115423977375, -0.0358550064265728, -0.03712230920791626, -0.008256055414676666, -0.006516255438327789, 0.034379396587610245, 0.014384713023900986, -0.047380127012729645, 0.02085021510720253, 0.0022583231329917908, -0.04083331674337387, -0.016838647425174713, -0.010977793484926224, 0.030134234577417374, -0.04268718883395195, 0.049506377428770065, -0.026565004140138626, -0.0035896413028240204, -0.03558316081762314, 0.047764722257852554, -0.03580193594098091, -0.03951059654355049, -0.02757422998547554, -0.003195773810148239, -0.01835113763809204, 0.046404484659433365, 0.02480076625943184, -0.008547782897949219, 0.03807275369763374, 0.0037955641746520996], [-0.04225904867053032, -0.003335237503051758, -0.0251105185598135, -0.031295955181121826, 0.03238651528954506, 0.028000783175230026, 0.03128189966082573, 0.03716938570141792, -0.01332705095410347, -0.03524618223309517, -0.026028990745544434, 0.0498521663248539, -0.01242976263165474, 0.03632941469550133, 0.04786628857254982, 0.01824977621436119, 0.012494254857301712, -0.03929268196225166, 0.04753449931740761, -0.022898448631167412, 0.00998549535870552, 0.02830817922949791, -0.016775943338871002, -0.04913697391748428, 0.029752660542726517, -0.020336998626589775, 0.03270833566784859, -0.010821439325809479, 0.041901495307683945, 0.01188366487622261, -0.009388424456119537, 0.009303618222475052, -0.03719799593091011, 0.027517620474100113, 0.000702299177646637, -0.042546309530735016, 0.007518209517002106, 0.04154285416007042, 0.042277220636606216, -0.03761962801218033, -0.03259992599487305, 0.02090158686041832, -0.038395561277866364, 0.035869430750608444, -0.02134634368121624, 0.048282552510499954, -0.007008720189332962, 0.044538918882608414, 0.03926309570670128, 0.044761572033166885, 0.004493772983551025, -0.04943889379501343, 0.015123669058084488, 0.011937342584133148, -0.03473871946334839, 0.016777146607637405, -0.022296642884612083, 0.028254341334104538, 0.04917169734835625, -0.03223627805709839, -0.022074175998568535, 0.04772705212235451, -0.028876662254333496, -0.01587643474340439], [-0.01715492084622383, -0.033881865441799164, -0.032972563058137894, -0.02903132513165474, -0.002917099744081497, 0.021709274500608444, -0.018322549760341644, 0.030029091984033585, 0.038553621619939804, -0.048464953899383545, 0.03585629537701607, -0.03569493442773819, 0.046097803860902786, 0.021402444690465927, 0.011075399816036224, 0.02119436487555504, -0.026095105335116386, 0.028113272041082382, -0.04633401706814766, -0.03929175063967705, 0.04656844213604927, -0.013606715947389603, 0.005852602422237396, -0.019809747114777565, -0.004035722464323044, 0.023751068860292435, 0.0023377425968647003, -0.006338775157928467, -0.016318630427122116, 0.032301854342222214, -0.01686108112335205, -0.029932452365756035, 0.03763873502612114, 0.03843773528933525, 0.033672306686639786, -0.04380941390991211, 0.005086410790681839, 0.03626431152224541, 0.03946583345532417, -0.04319232702255249, 0.01928592100739479, -0.042531680315732956, 0.019937623292207718, 0.02271387353539467, -0.047295283526182175, -0.044346679002046585, -0.04099346324801445, -0.02023603953421116, -0.03358504921197891, -0.0474441759288311, 0.04609120264649391, -0.020950032398104668, 0.013503361493349075, 0.022460687905550003, 0.02088150754570961, -0.01092921569943428, 0.029334809631109238, 0.04472268745303154, -0.03254757076501846, -4.567205905914307e-06, 0.036506716161966324, -0.005254663527011871, -0.024484897032380104, 0.025753390043973923], [-0.005224980413913727, -0.04145184904336929, 0.02539367601275444, 0.014399435371160507, -0.0006460919976234436, 0.034796763211488724, 